In [2]:
import mysql.connector

mydb = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="8888",
    database="COLLEGE"
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002B5FBC16A10>

In [3]:
mycursor = mydb.cursor()
mycursor.execute("CREATE TABLE IF NOT EXISTS STUDENTS (Roll_No INT PRIMARY KEY, Name VARCHAR(50), Marks INT NOT NULL, Grade VARCHAR(1), City VARCHAR(20))")

In [4]:
mycursor.execute("SHOW TABLES")
for db in mycursor:
    print(db)

('students',)

In [5]:
mycursor = mydb.cursor()

sqlFormula = "INSERT INTO STUDENTS (Roll_No, Name, Marks, Grade, City) VALUES (%s, %s, %s, %s, %s)"
STUDENTS1 = (101, "Anil", 78, "C", "Pune")

mycursor.execute(sqlFormula, STUDENTS1)

mydb.commit()

In [6]:
mycursor = mydb.cursor()

sqlFormula = "INSERT INTO STUDENTS (Roll_No, Name, Marks, Grade, City) VALUES (%s, %s, %s, %s, %s)"
STUDENTS1 = [(102, "Bhumika", 93, "A", "Mumbai"),
             (103, "Chetan", 85, "B", "Mumbai"),
             (104, "Dhruv", 96, "A", "Delhi"),
             (105, "Emanuel", 12, "F", "Delhi"),
             (106, "Farah", 82, "B", "Delhi")]

mycursor.executemany(sqlFormula, STUDENTS1)

mydb.commit()

In [7]:
mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM STUDENTS")
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(101, 'Anil', 78, 'C', 'Pune')
(102, 'Bhumika', 93, 'A', 'Mumbai')
(103, 'Chetan', 85, 'B', 'Mumbai')
(104, 'Dhruv', 96, 'A', 'Delhi')
(105, 'Emanuel', 12, 'F', 'Delhi')
(106, 'Farah', 82, 'B', 'Delhi')

In [8]:
mycursor = mydb.cursor()

mycursor.execute("SELECT Marks FROM STUDENTS")
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(78,)
(93,)
(85,)
(96,)
(12,)
(82,)

In [9]:
mycursor = mydb.cursor()

mycursor.execute("SELECT Marks FROM STUDENTS")
myresult = mycursor.fetchone()
for row in myresult:
    print(row)

78

In [10]:
import mysql.connector

mydb = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="8888",
    database="COLLEGE"
)

mycursor = mydb.cursor()

sql = "SELECT * FROM STUDENTS WHERE Marks > 80"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(102, 'Bhumika', 93, 'A', 'Mumbai')
(103, 'Chetan', 85, 'B', 'Mumbai')
(104, 'Dhruv', 96, 'A', 'Delhi')
(106, 'Farah', 82, 'B', 'Delhi')

In [11]:
mycursor = mydb.cursor()

sql = "SELECT * FROM STUDENTS WHERE City = 'Mumbai'"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(102, 'Bhumika', 93, 'A', 'Mumbai')
(103, 'Chetan', 85, 'B', 'Mumbai')

In [12]:
mycursor = mydb.cursor()

sql = "SELECT * FROM STUDENTS WHERE City = 'Mumbai'"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(102, 'Bhumika', 93, 'A', 'Mumbai')
(103, 'Chetan', 85, 'B', 'Mumbai')

In [13]:
mycursor = mydb.cursor()

sql = "SELECT * FROM STUDENTS WHERE City LIKE 'De%'"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(104, 'Dhruv', 96, 'A', 'Delhi')
(105, 'Emanuel', 12, 'F', 'Delhi')
(106, 'Farah', 82, 'B', 'Delhi')

In [14]:
mycursor = mydb.cursor()

sql = "SELECT * FROM STUDENTS WHERE City LIKE '%um%'"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(102, 'Bhumika', 93, 'A', 'Mumbai')
(103, 'Chetan', 85, 'B', 'Mumbai')

In [15]:
mycursor = mydb.cursor()

sql = "SELECT * FROM STUDENTS WHERE City = %s"
mycursor.execute(sql, ("Delhi", ))
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(104, 'Dhruv', 96, 'A', 'Delhi')
(105, 'Emanuel', 12, 'F', 'Delhi')
(106, 'Farah', 82, 'B', 'Delhi')

In [16]:
sql = "UPDATE STUDENTS SET Marks = 80 WHERE Roll_No = 105"
mycursor.execute(sql)
mydb.commit()

In [17]:
sql = "SELECT * FROM STUDENTS LIMIT 5"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(101, 'Anil', 78, 'C', 'Pune')
(102, 'Bhumika', 93, 'A', 'Mumbai')
(103, 'Chetan', 85, 'B', 'Mumbai')
(104, 'Dhruv', 96, 'A', 'Delhi')
(105, 'Emanuel', 80, 'F', 'Delhi')

In [18]:
sql = "SELECT * FROM STUDENTS LIMIT 5 OFFSET 2"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(103, 'Chetan', 85, 'B', 'Mumbai')
(104, 'Dhruv', 96, 'A', 'Delhi')
(105, 'Emanuel', 80, 'F', 'Delhi')
(106, 'Farah', 82, 'B', 'Delhi')

In [19]:
sql = "SELECT * FROM STUDENTS ORDER BY Name"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(101, 'Anil', 78, 'C', 'Pune')
(102, 'Bhumika', 93, 'A', 'Mumbai')
(103, 'Chetan', 85, 'B', 'Mumbai')
(104, 'Dhruv', 96, 'A', 'Delhi')
(105, 'Emanuel', 80, 'F', 'Delhi')
(106, 'Farah', 82, 'B', 'Delhi')

In [20]:
sql = "SELECT * FROM STUDENTS ORDER BY Name DESC"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(106, 'Farah', 82, 'B', 'Delhi')
(105, 'Emanuel', 80, 'F', 'Delhi')
(104, 'Dhruv', 96, 'A', 'Delhi')
(103, 'Chetan', 85, 'B', 'Mumbai')
(102, 'Bhumika', 93, 'A', 'Mumbai')
(101, 'Anil', 78, 'C', 'Pune')

In [21]:
sql = "SELECT * FROM STUDENTS ORDER BY City DESC"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(101, 'Anil', 78, 'C', 'Pune')
(102, 'Bhumika', 93, 'A', 'Mumbai')
(103, 'Chetan', 85, 'B', 'Mumbai')
(104, 'Dhruv', 96, 'A', 'Delhi')
(105, 'Emanuel', 80, 'F', 'Delhi')
(106, 'Farah', 82, 'B', 'Delhi')

In [22]:
import mysql.connector

mydb = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="8888",
    database="COLLEGE"
)

mycursor = mydb.cursor()

sql = "DELETE FROM STUDENTS WHERE Name ='Emanuel'"
mycursor.execute(sql)
mydb.commit()

In [23]:
sql = "SELECT * FROM STUDENTS"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for row in myresult:
    print(row)

(101, 'Anil', 78, 'C', 'Pune')
(102, 'Bhumika', 93, 'A', 'Mumbai')
(103, 'Chetan', 85, 'B', 'Mumbai')
(104, 'Dhruv', 96, 'A', 'Delhi')
(106, 'Farah', 82, 'B', 'Delhi')

In [24]:
sql = "DROP TABLE  IF EXISTS STUDENTS"
mycursor.execute(sql)
mydb.commit()

In [25]:
sql = "DROP DATABASE  IF EXISTS COLLEGE"
mycursor.execute(sql)
mydb.commit()